import React from 'react';
import Container from 'react-bootstrap/Container';

const Policy = () => (
  <Container className="privacy-and-policy">
    <h1>Політика конфіденційності БО "БФ "Архангельєри Києва""</h1>
		<p>
			У Благодійному Фонді "Арханегльєри Києва" ми розуміємо важливість захисту приватності наших донорів
			та прихильників. Ми зобов'язуємось забезпечити, що будь-яка особиста інформація, яку нам надають,
			обробляється з обережністю та зберігається конфіденційно.
		</p>
		<p>
			Ми збираємо особисту інформацію від наших донорів та прихильників, таку як імена, 
			електронні адреси та історію пожертвувань, щоб ефективно обробляти пожертви, 
			спілкуватися з донорами та надсилати їм оновлення та інформацію про наші благодійні діяльності. 
			Ця інформація доступна тільки авторизованим працівникам, які потребують її для виконання своїх обов'язків.
		</p>
		<p>
			Ми не будемо розкривати жодну особисту інформацію про наших донорів або прихильників третім сторонам 
			без їхньої згоди, крім випадків, передбачених законом. Ми не продаємо або обмінюємо будь-яку особисту 
			інформацію, зібрану від наших донорів та прихильників.
		</p>
    <p>
			Ми вживаємо всіх розумних заходів для захисту конфіденційності та безпеки особистої інформації 
      що знаходиться в нашому розпорядженні, від несанкціонованого доступу, збору, використання, розкриття, копіювання, модифікації,
      видалення або знищення. Ми використовуємо відповідні фізичні, електронні та адміністративні засоби захисту, щоб 
      для забезпечення безпеки особистої інформації.
    </p>
    <p>
			Донори та прихильники мають право на доступ, виправлення або вимогу видалення
      особистої інформації, якою ми володіємо. Ми своєчасно відповідатимемо на такі запити та 
      докладатимемо всіх розумних зусиль для їх виконання, з урахуванням будь-яких законодавчих або договірних обмежень.
    </p>
    <p>
			Здійснюючи пожертвування на користь фонду, донори та прихильники визнають та погоджуються на збір, 
      використання та розголошення їхньої особистої інформації, як описано в цій політиці конфіденційності. 
			Якщо у вас виникли запитання або занепокоєння щодо нашої політики конфіденційності або того, як ми обробляємо особисту інформацію,
      будь ласка, зв'яжіться з нами за адресою <a href="mailto:admin@archangels.in.ua">admin@archangels.in.ua</a>.
    </p>
  </Container>
);

export default Policy;

