import React from 'react';
import Container from 'react-bootstrap/Container';

const RefundPolicy = () => (
  <Container className="refund-policy">
    <h1>Політика повернення коштів БО "БФ "Архангельєри Києва""</h1>
    <p>
      <b>Останнє оновлення: 7 березня 2023 року</b>
    </p>
    <p>
      Благодійний фонд "Архангельєри Києва" цінує довіру та підтримку наших
      жертводавців. Ми прагнемо, щоб усі пожертви були використані відповідно до
      нашої місії та цінностей. Якщо з якихось причин ви не задоволені своєю
      пожертвою, ми зробимо все можливе, щоб це виправити.
    </p>
    <h2>Повернення пожертв</h2>
    <p>
      Благодійний фонд "Архангельєри Києва" поверне кошти за будь-яку зроблену
      пожертву, якщо жертводавець звернеться до нас протягом 30 днів з дня
      здійснення пожертви. Повернення коштів буде здійснено в тій самій формі, в
      якій було зроблено початковий внесок.
    </p>
    <h2>Як отримати відшкодування</h2>
    <p>
      Щоб отримати відшкодування, будь ласка, зв'яжіться з нами електронною
      поштою за адресою{' '}
      <a href="mailto:admin@archangels.in.ua">admin@archangels.in.ua</a> і
      вкажіть своє ім'я, контактну інформацію, а також дату і суму пожертви.
    </p>
    <h2>Винятки з політики повернення коштів</h2>
    <p>
      Благодійний фонд "Архангельєри Києва" залишає за собою право відхиляти
      запити на повернення коштів у випадках, коли є докази шахрайства або
      зловживання нашою політикою щодо пожертв. Ми також залишаємо за собою
      право відмовити у поверненні коштів за пожертви, зроблені через сторонні
      платформи, такі як краудфандингові веб-сайти або кампанії зі збору коштів
      у соціальних мережах.
    </p>
    <h2>Зміни до цієї Політики відшкодування</h2>
    <p>
      Благодійний фонд "Архангельєри Києва" залишає за собою право вносити зміни
      до цієї політики відшкодування в будь-який час. Будь-які зміни будуть
      опубліковані на нашому сайті і будуть застосовуватися тільки до
      пожертвувань, зроблених після дати внесення змін.
    </p>
    <p>
      Якщо у вас виникли будь-які питання щодо цієї політики повернення коштів
      або вашої пожертви, будь ласка, зв'яжіться з нами за адресою{' '}
      <a href="mailto:admin@archangels.in.ua">admin@archangels.in.ua</a>.
    </p>
  </Container>
);

export default RefundPolicy;
