import React from 'react';
import Container from 'react-bootstrap/Container';

const Terms = () => (
  <Container>
    <div class="terms_page" id="en">
      <h1>Загальні положення та умови</h1>
      <p>Останнє оновлення: 10 листопада 2022 року</p>
      <p>Будь ласка, уважно прочитайте ці положення та умови, перш ніж користуватися нашим Сервісом.</p>
      <h1>Тлумачення та визначення</h1>
      <h2>Тлумачення</h2>
      <p>
       Слова, початкова буква яких написана з великої літери, мають значення, визначені відповідно до наступних умов. 
       Наведені нижче визначення мають однакове значення незалежно від того, в однині чи множині вони зустрічаються.
      </p>
      <h2>Визначення</h2>
      <p>Для цілей цих Загальних положень та умов:</p>
      <ul>
        <li>
          <p>
            <strong>Афілійована</strong> особа означає суб'єкт господарювання, який контролює, контролюється або перебуває під спільним контролем зі стороною, де "контроль" означає володіння 50% або більше акцій, паїв або інших цінних паперів, що дають право голосу при обранні директорів або іншого керівного органу.
          </p>
      </li>
      <li>
        <p><strong>Країна</strong> на яку посилається: Україна</p>
      </li>
      <li>
        <p><strong>Компанія</strong> (у цьому Договорі іменується як "Компанія", "Ми", "Нас" або "Наш") означає "Архангельєри Києва".</p>
      </li>
      <li>
        <p><strong>Пристрій</strong> означає будь-який пристрій, який може отримати доступ до Сервісу, наприклад, комп'ютер, мобільний телефон або цифровий планшет.</p>
      </li>
      <li>
        <p><strong>Сервіс</strong> означає Веб-сайт.</p>
      </li>
      <li>
        <p><strong>Загальні положення та умови</strong> (також іменовані "Умови") - ці Загальні положення та умови, які складають повну угоду між Вами та Компанією щодо використання Сервісу.</p>
      </li>
      <li>
        <p><strong>Сторонній сервіс соціальних мереж</strong> означає будь-які послуги або контент (включаючи дані, інформацію, продукти або послуги), що надаються третьою стороною, які можуть відображатися, включатися або ставати доступними за допомогою Сервісу.</p>
      </li>
      <li>
        <p><strong>Веб-сайт</strong> - веб-сайт Архангельєри Києва, доступний за адресою <a href="https://www.archangels.in.ua" rel="external nofollow noopener noreferrer" target="_blank">https://www.archangels.in.ua</a></p>
      </li>
      <li>
        <p><strong>Ви</strong> - фізична особа, яка отримує доступ до Сервісу або користується ним, або компанія, або інша юридична особа, від імені якої така особа отримує доступ до Сервісу або користується ним, залежно від обставин.</p>
      </li>
      </ul>
      <h1>Підтвердження</h1>
      <p>Це Положення та умови, що регулюють використання цього Сервісу, а також угода, яка діє між Вами та Компанією. Ці Умови визначають права та обов'язки всіх користувачів щодо використання Сервісу.</p>
      <p>Ваш доступ до Сервісу та користування ним обумовлений Вашим прийняттям та дотриманням цих Умов. Ці Умови застосовуються до всіх відвідувачів, користувачів та інших осіб, які отримують доступ до Сервісу або користуються ним.</p>
      <p>Отримуючи доступ до Сервісу або використовуючи його, Ви погоджуєтеся дотримуватися цих Умов. Якщо Ви не згодні з будь-якою частиною цих Умов, Ви не можете отримати доступ до Сервісу.</p>
      <p>Ви підтверджуєте, що Вам виповнилося 18 років. Компанія не дозволяє особам, які не досягли 18 років, користуватися Сервісом.</p>
      <p>Ваш доступ до Сервісу та його використання також обумовлений Вашим прийняттям і дотриманням Політики конфіденційності Компанії. Наша Політика конфіденційності описує нашу політику і процедури щодо збору, використання та розкриття Вашої особистої інформації, коли Ви використовуєте Додаток або Веб-сайт, а також інформує Вас про Ваші права на конфіденційність і про те, як закон захищає Вас. Будь ласка, уважно прочитайте нашу Політику конфіденційності, перш ніж користуватися Нашим Сервісом.</p>
      <h1>Посилання на інші веб-сайти</h1>
      <p>Наш Сервіс може містити посилання на сторонні веб-сайти або послуги, які не належать або не контролюються Компанією.</p>
      <p>Компанія не контролює і не несе ніякої відповідальності за зміст, політику конфіденційності або практику будь-яких сторонніх веб-сайтів або послуг. Ви також визнаєте і погоджуєтеся, що Компанія не несе відповідальності або зобов'язань, прямо або побічно, за будь-яку шкоду або збитки, заподіяні або передбачувані внаслідок або у зв'язку з використанням або довірою до будь-якого такого контенту, товарів або послуг, доступних на будь-яких таких веб-сайтах або через будь-які такі веб-сайти або послуги.</p>
      <p>Ми настійно рекомендуємо Вам ознайомитися з умовами та політикою конфіденційності будь-яких сторонніх веб-сайтів або послуг, які Ви відвідуєте.</p>
      <h1>Припинення дії</h1>
      <p>Ми можемо припинити або призупинити Ваш доступ негайно, без попереднього повідомлення або відповідальності, з будь-якої причини, в тому числі, без обмежень, якщо Ви порушуєте ці Умови.</p>
      <p>Після припинення Ваше право на використання Сервісу негайно припиняється.</p>
      <h1>Обмеження відповідальності</h1>
      <p>Незважаючи на будь-які збитки, які Ви можете понести, вся відповідальність Компанії та будь-яких її постачальників за будь-яким положенням цих Умов і Ваш виключний засіб правового захисту у зв'язку з усім вищевикладеним обмежується сумою, фактично сплаченою Вами за допомогою Сервісу, або 100 доларами США, якщо Ви нічого не купували за допомогою Сервісу.</p>
      <p>У максимальному обсязі, дозволеному чинним законодавством, ні за яких обставин Компанія або її постачальники не несуть відповідальності за будь-які спеціальні, випадкові, непрямі або побічні збитки (включаючи, але не обмежуючись, збитки за упущену вигоду, втрату даних або іншої інформації, за переривання бізнесу, за тілесні ушкодження, втрату конфіденційності, що виникли в результаті або будь-яким чином пов'язані з використанням або неможливістю використання Сервісу, стороннього програмного забезпечення та/або стороннього обладнання, що використовується з Сервісом, або іншим чином у зв'язку з будь-яким положенням цих Умов), навіть якщо Компанія або будь-який постачальник були повідомлені про можливість таких збитків, і навіть якщо засіб правового захисту не досягне своєї основної мети.</p>
      <p>У деяких штатах не допускається виключення маються на увазі гарантій або обмеження відповідальності за випадкові або непрямі збитки, що означає, що деякі з вищевказаних обмежень можуть не застосовуватися. У цих державах відповідальність кожної сторони буде обмежена в найбільшій мірі, дозволеній законом.</p>
      <h1>Відмова від відповідальності "ЯК Є" і "ЯК ДОСТУПНО"</h1>
      <p>
         Послуга надається Вам на умовах "ЯК Є" і "ЯК ДОСТУПНО" та з усіма недоліками і дефектами без будь-яких гарантій. У максимальному обсязі, дозволеному чинним законодавством, Компанія від свого імені та від імені своїх Афілійованих осіб, а також своїх та їх відповідних ліцензіарів та постачальників послуг прямо відмовляється від усіх гарантій, явних, неявних, встановлених законом або інших, щодо Послуги, включаючи всі неявні гарантії товарного стану, придатності для певної мети, права власності та непорушення, а також гарантії, які можуть виникнути в ході ведення справ, виконання, використання або торгової практики. Без обмеження вищевикладеного, Компанія не надає жодних гарантій або зобов'язань і не робить жодних заяв про те, що Послуга буде відповідати Вашим вимогам, досягне будь-яких запланованих результатів, буде сумісною або працюватиме з будь-яким іншим програмним забезпеченням, додатками, системами або послугами, працюватиме без перебоїв, відповідатиме будь-яким стандартам продуктивності або надійності або не міститиме помилок, або що будь-які помилки або дефекти можуть бути або будуть виправлені.
      </p>
      <p>Не обмежуючи вищевикладене, ні Компанія, ні будь-який її постачальник не робить жодних заяв або гарантій будь-якого виду, явних або неявних: (i) щодо роботи або доступності Сервісу, або інформації, контенту, матеріалів або продуктів, включених до нього; (ii) що Сервіс буде безперебійним або безпомилковим; (iii) щодо точності, надійності або актуальності будь-якої інформації або контенту, наданого через Сервіс; або (iv) що Сервіс, його сервери, контент або електронні листи, відправлені від імені Компанії, не містять вірусів, скриптів, троянських коней, черв'яків, шкідливих програм, бомб уповільненої дії або інших шкідливих компонентів.</p>
      <p>Деякі юрисдикції не допускають виключення певних видів гарантій або обмеження застосовних законних прав споживача, тому деякі або всі вищевказані виключення і обмеження можуть не поширюватися на Вас. Але в такому випадку винятки та обмеження, викладені в цьому розділі, застосовуються в найбільшій мірі, яка може бути застосована відповідно до чинного законодавства.</p>
      <h1>Регулююче законодавство</h1>
      <p>Законодавство Країни, за винятком колізійних норм, регулює ці Умови та Ваше користування Сервісом. Використання Вами Додатку також може регулюватися іншими місцевими, державними, національними або міжнародними законами.</p>
      <h1>Вирішення спорів</h1>
      <p>Якщо у Вас виникне будь-яке занепокоєння або суперечка щодо Сервісу, Ви погоджуєтеся спочатку спробувати вирішити суперечку неформально, зв'язавшись з Компанією.</p>
      <h1>Для користувачів з Європейського Союзу (ЄС)</h1>
      <p>Якщо Ви є споживачем Європейського Союзу, на Вас поширюються будь-які обов'язкові положення законодавства країни, в якій Ви проживаєте.</p>
      <h1>Дотримання законодавства Сполучених Штатів Америки</h1>
      <p>Ви заявляєте і гарантуєте, що (i) Ви не перебуваєте в країні, на яку поширюється ембарго уряду Сполучених Штатів або яка була визначена урядом Сполучених Штатів як країна, що підтримує тероризм, і (ii) Ви не включені до жодного списку заборонених або обмежених сторін, складеного урядом Сполучених Штатів.</p>
      <h1>Відокремлюваність та відмова від прав</h1>
      <h2>Відокремлюваність</h2>
      <p>Якщо будь-яке положення цих Умов буде визнано нездійсненним або недійсним, таке положення буде змінено та витлумачено для досягнення цілей такого положення в найбільшій мірі відповідно до чинного законодавства, а решта положень залишатимуться в повній силі та дії.</p>
      <h2>Відмова</h2>
      <p>За винятком випадків, передбачених у цьому документі, невиконання права або вимоги виконання зобов'язання за цими Умовами не впливає на здатність сторони здійснювати таке право або вимагати такого виконання в будь-який час після цього, а також відмова від порушення не є відмовою від будь-якого подальшого порушення.</p>
      <h1>Переклад Тлумачення</h1>
      <p>Ці Умови могли бути перекладені, якщо Ми зробили їх доступними для Вас на нашому Сервісі. Ви погоджуєтеся, що оригінальний текст англійською мовою має переважну силу в разі виникнення суперечки.</p>
      <h1>Зміни до цих Умов та положень</h1>
      <p>Ми залишаємо за собою право на власний розсуд змінювати або замінювати ці Умови в будь-який час. Якщо зміни є суттєвими, Ми докладемо розумних зусиль, щоб надати повідомлення принаймні за 30 днів до того, як будь-які нові умови набудуть чинності. Те, що є суттєвою зміною, буде визначено на Наш власний розсуд.</p>
      <p>Продовжуючи отримувати доступ до Нашого Сервісу або користуватися ним після того, як ці зміни набудуть чинності, Ви погоджуєтеся дотримуватися переглянутих умов. Якщо Ви не згодні з новими умовами, повністю або частково, будь ласка, припиніть використання веб-сайту та Сервісу.</p>
      <h1>Зв'язок з нами</h1>
      <p>Якщо у Вас виникли будь-які питання щодо цих Умов, Ви можете зв'язатися з нами:</p>
      <ul>
        <li>Електронною поштою: <a href="mailto:admin@archangels.in.ua">admin@archangels.in.ua</a></li>
      </ul>
  </div>
</Container>
);

export default Terms;